Revit 2026 API

# Subelement Properties

---

The Subelement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Category | Retrieves a Category object that represents the category or sub category of the subelement. |
|  | Document | The document in which the subelement resides. |
|  | Element | The element in which the subelement resides. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TypeId | The identifier of this subelement's type. |
|  | UniqueId | A stable unique identifier for this subelement within the document. |

#### Reference

Subelement Class

Autodesk.Revit.DB Namespace